#include<stdio.h>

/*
Задача 2: Въвежда се цяло число. Ако числото е четно, да се изведе 1 на стандартния изход. В противен случай, да се изведе 0.
Вход: 265, Изход: 0
Вход: 290, Изход: 1
*/
int main01_2()
{
	int number;
	scanf_s("%d", &number);
	printf("%d", number % 2 == 0);
	return 0;
}