#include<stdio.h>

/*
Задача 1: Въвежа се цяло число. Да се отпечата 1, ако числото е валидна оценка от училище, и 0, ако не е валидна.
Вход: 3, Изход: 1
Вход: 10, Изход: 0
*/
int main01_1()
{
	int grade;
	scanf_s("%d", &grade);
	printf("%d", grade >= 2 && grade <= 6);

	return 0;
}