#include<stdio.h>

/*
Напишете програма, която прочита от конзолата цяло число, което ще бъде валидна година и проверява дали тази година е високосна. В решенето на задачата създайте и използвайте функция предикат (функция, която връща булева стойност: 0/FALSE или 1/TRUE) isleapYear.

Една година е високосна, ако:

се дели на 4 и не се дели на 100, или
се дели на 400.
*/

int isLeapYear(int year){
	return (year % 4 == 0) && (year % 100 != 0) || year % 400 == 0;
}

int main_4()
{
	int number;
	scanf_s("%d", &number);
	printf("%d", isLeapYear(number));
}