#include<stdio.h>

/*
Задача 8: Въвежда се трицифрено цяло число n.

Ако последната цифра на въведеното число е 0, 2, 4, 6 или 8, тази цифра да се замени с остатъкът на цифрата по модул 3.
Ако последната цифра на въведеното число е 1, 3, 5, 7 или 9, тази цифра да се замени с остатъкът на цифрата по модул 2.
Вход: 123, Изход: 121
Вход: 718, Изход: 712
*/
int main()
{
	int number;
	scanf_s("%d", &number);

	int lastNumber = number % 10;
	number = (number - lastNumber) + ( lastNumber % 2 == 0 ? lastNumber % 3 : lastNumber % 2);

	printf("-> %d", number);

	return 0;
}