#include<stdio.h>

/*
Задача 1: Да се напише програма, която приема цяло положително число n, последвано от n на брой години.
Да се отпечата броя на въведените високосни години.
Вход: 7 1928 1956 1984 2012 2040 2068 2096, Изход: 7
Вход: 7 1909 1915 1926 1937 1943 1954 1965, Изход: 0
Вход: 9 1919 1930 1941 1936 2066 2077 2083 1964 1992, Изход: 3
*/
int main_03_01()
{
	int n = 0;
	scanf_s("%d", &n);

	int year;
	int leapYearsCount = 0;
	for (int i = 0; i < n; i++)
	{
		scanf_s("%d", &year);

		if (year % 4 == 0 && year % 100 != 0 || year % 400 == 0)
			leapYearsCount++;
	}

	printf("Leaps years -> %d", leapYearsCount);
	return 0;
}