#include<stdio.h>

/*
Задача 4 (Редица трион): Ще казваме, че редица от числа е трион, ако всяко число в нея е едновременно или по-голямо или равно от двата си съседа, или по-малко или равно от тях. За първия и последния елемент имаме само по един съсед. Да се напише програма, която при подадени 5 на брой цели числа извежда на стандартния изход "yes", ако въведената редица е трион и "no", ако не е.
Вход: 1 5 1 0 3, Изход: no
Вход: -10 10 -2 11 -22, Изход: yes
*/
int main_02_04()
{
	// arrays required
	return 0;
}